import sys
read = sys.stdin.readline
'''
1 : 1
    1개
2 : 1 + 1
    2
    2개
3 : 1 + 1 + 1
    1 + 2
    2 + 1
    3
    4개
4 : 1 + 1 + 1 + 1
    1 + 1 + 2
    1 + 2 + 1
    2 + 1 + 1
    2 + 2
    1 + 3
    3 + 1
    7개
5 : 1 + 1 + 1 + 1 + 1
    1 + 1 + 1 + 2
    1 + 1 + 2 + 1
    1 + 2 + 1 + 1
    2 + 1 + 1 + 1
    1 + 2 + 2
    2 + 1 + 2
    2 + 2 + 1
    1 + 1 + 3
    1 + 3 + 1
    3 + 1 + 3
    2 + 3
    3 + 2
    13개
'''
dp = [0, 1, 2, 4] + [0] * 8

for i in range(4, 12):
    dp[i] = dp[i-1] + dp[i-2] + dp[i-3]

T = int(read())

for _ in range(T):
    n = int(read())
    print(dp[n])